#################################################### 前期准备 ################################################
###############   1、策略制定 ###############
#  1、股票软件写公式画图筛选
#  2、得出多种公式
###############  2、选股策略测试 ###############
#  1、配置策略
        # 根据公式配置调优策略参数
#  2、回测策略
        # 人为根据大盘走势选取对应策略
        # 输入起始结束时间回测策略收益
###############  3、买卖点制定 ###############
#  1、配置买点
        # 根据分时线确定买点
        # 根据分时线确定卖点
###############  4、买卖点回测 ###############
#  1、确定时间
#  2、确定选股策略
#  3、模拟执行买卖点
#  4、计算收益+迭代优化
###############  5、实盘交易相关准备 ##########
#  1、准备量化账户
#  2、对接量化账户下单接口
#  3、模拟盘操作测试

#################################################### 实际运行 ################################################
################   1、选股    前一天运行 ################
#  1、选用策略
#  2、根据策略选股
#  3、筛选出的股票保存下来（人为确认）
################  2、下单买入  当天运行  ################
#  1、循环获取前一天筛选的股票分钟线
#  2、选用下单策略
        # 配置 买入价格
        # 配置 买入仓位
#  3、执行下单操作，记录买入的股票+仓位
###############  3、止盈止损  当天运行  ################
#
#  1、循环所有买入的股票分钟线
#  2、选取止盈、止损策略
#  3、执行止盈止损，记录止盈止损的股票+仓位
